Exercise with csv

In [1]:
import pandas as pd

In [25]:
df = pd.read_csv("data/ex2.csv", sep=',',header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [29]:
#let's specify the header
names = ['a', 'b', 'c', 'd','message']
pd.read_csv('data/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [31]:
#we can specify the lines that shouldn't be in the dataframe

pd.read_csv("data/ex4.csv", skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [33]:
import numpy as np
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [35]:
#remove missing number
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [36]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [37]:
data.notnull()

0     True
1    False
2     True
3    False
4     True
dtype: bool

In [58]:
data1 = pd.DataFrame([[1., 6.5, 3.], [3, 5., 9, 32] ,[1, 5 , np.nan, np.nan], [np.nan, 4, 6 ,np.nan]])
data1

     0    1    2     3
0  1.0  6.5  3.0   NaN
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   NaN
3  NaN  4.0  6.0   NaN

In [46]:
data1.dropna(inplace=True)
data1

     0    1    2     3
1  3.0  5.0  9.0  32.0

In [49]:
data1.dropna(axis=1, inplace=True)
data1

     1
0  6.5
1  5.0
2  5.0
3  4.0

In [54]:
#data.dropna(how='all')
data1.dropna(how='any')

     0    1    2     3
1  3.0  5.0  9.0  32.0

In [ ]:
#delete the lines that have atleast 2 nan
df.dropna(tresh=2)

In [ ]:
data1.fillna(42) #replace the nan with 32

      0    1     2     3
0   1.0  6.5   3.0  42.0
1   3.0  5.0   9.0  32.0
2   1.0  5.0  42.0  42.0
3  42.0  4.0   6.0  42.0

In [61]:
data1

     0    1    2     3
0  1.0  6.5  3.0   NaN
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   NaN
3  NaN  4.0  6.0   NaN

In [ ]:
data1.fillna({0: 0.5, 3: 0}) #fill the nan based on the column, use inplace if you want that the change is defined

     0    1    2     3
0  1.0  6.5  3.0   0.0
1  3.0  5.0  9.0  32.0
2  1.0  5.0  NaN   0.0
3  0.5  4.0  6.0   0.0

In [66]:
data1.fillna(data1.mean())

          0    1    2     3
0  1.000000  6.5  3.0  32.0
1  3.000000  5.0  9.0  32.0
2  1.000000  5.0  6.0  32.0
3  1.666667  4.0  6.0  32.0

Removing Duplicates

In [68]:
data2 = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                      'k2': [1, 1, 2, 3, 3, 4, 4]})
data2

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [ ]:
data2.duplicated() #if the rows is duplicated

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [70]:
data2.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [72]:
data = pd.DataFrame({'device': ['iphone', 'galaxy', 'ipad'], 'price': [987, 1045, 680]})
data

   device  price
0  iphone    987
1  galaxy   1045
2    ipad    680

In [74]:
device_brand = {'iphone': 'Apple', 'ipad': 'Apple', 'galaxy': 'Samsung'}

In [75]:
#new column with the info from dict

data['brand'] = data['device'].str.lower().map(device_brand)
data

   device  price    brand
0  iphone    987    Apple
1  galaxy   1045  Samsung
2    ipad    680    Apple